УТ_для_edt.РасширениеСмарт/src/Reports/АнализСебестоимостиТоваровРасширенный/АнализСебестоимостиТоваровРасширенный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="470bb922-df12-481c-bca5-2bc9b825880d">
  <name>АнализСебестоимостиТоваровРасширенный</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Report>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЦеныНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/Reports/АнализСебестоимостиТоваровРасширенный/ObjectModule.bsl
#Область ПеренесеноСдоработками

&ИзменениеИКонтроль("ПриКомпоновкеРезультата")
Процедура смарт_ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПользовательскиеНастройкиМодифицированы = Ложь;

	КонтрольИспользованияАналитикиОборотов(КомпоновщикНастроек);

	СхемаКомпоновкиДанных.НаборыДанных.ОсновнаяАналитика.Запрос = ИсполняемыйЗапросОсновнаяАналитика();
	СхемаКомпоновкиДанных.НаборыДанных.ОборотнаяАналитика.Запрос = ИсполняемыйЗапросОборотнаяАналитика();
	СхемаКомпоновкиДанных.НаборыДанных.Документы.Запрос = ИсполняемыйЗапросДокументы();

	#Вставка
	//++ #1882 смарт: Шляпников 16.01.2025 / Отчет Себестоимость товаров. Добавить вывод розничных цен
	СкорректироватьЗапрос(СхемаКомпоновкиДанных.НаборыДанных.ОсновнаяАналитика.Запрос);
	//-- #1882 смарт: Шляпников 16.01.2025
	#КонецВставки
	
	УстановитьОбязательныеНастройки(ПользовательскиеНастройкиМодифицированы);

	УдалитьПоказателиИзОтборовРасшифровки(КомпоновщикНастроек);

	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();

	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ВыражениеПользовательскогоПоляНачальныйОстаток",
	НСтр("ru = 'Начальный остаток'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ВыражениеПользовательскогоПоляВсегоПриход",
	НСтр("ru = 'Всего приход'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ВыражениеПользовательскогоПоляВсегоРасход",
	НСтр("ru = 'Всего расход'"));
	НастройкиОтчета.ПараметрыДанных.УстановитьЗначениеПараметра("ВыражениеПользовательскогоПоляКонечныйОстаток",
	НСтр("ru = 'Конечный остаток'"));

	#Вставка
	//++ #1882 смарт: Шляпников 16.01.2025 / Отчет Себестоимость товаров. Добавить вывод розничных цен
	Параметр = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("ВидЦеныДоллар");
	Параметр.Использование = Истина;
	Параметр.Значение = Справочники.смартПредопределенныеЗначения.Настройки.ВидЦеныРозничнаяUSD;
	
	Параметр = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("ВидЦеныЕвро");
	Параметр.Использование = Истина;
	Параметр.Значение = Справочники.смартПредопределенныеЗначения.Настройки.ВидЦеныРозничнаяEUR;
	
	Параметр = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("ВидЦеныРубли");
	Параметр.Использование = Истина;
	Параметр.Значение = Справочники.смартПредопределенныеЗначения.Настройки.ВидЦеныРозничнаяRUB;
	
	Параметр = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("ВалютаДоллар");
	Параметр.Использование = Истина;
	Параметр.Значение = Справочники.смартПредопределенныеЗначения.Настройки.ВидЦеныРозничнаяUSD.ВалютаЦены;
	
	Параметр = НастройкиОтчета.ПараметрыДанных.Элементы.Найти("ВалютаЕвро");
	Параметр.Использование = Истина;
	Параметр.Значение = Справочники.смартПредопределенныеЗначения.Настройки.ВидЦеныРозничнаяEUR.ВалютаЦены;
	//-- #1882 смарт: Шляпников 16.01.2025
	#КонецВставки
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);

	// Проверим, используются ли оборотные аналитики
	КомпоновкаДанныхСервер.ОптимизацияИспользованияОборотнойАналитики(МакетКомпоновки, СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);

	КомпоновкаДанныхСервер.УстановитьЗаголовкиМакетаКомпоновки(СтруктураЗаголовковПолей(), МакетКомпоновки);

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);

	ПроверяемыеПоля = Новый Массив;
	ПроверяемыеПоля.Добавить("Партнер");
	ПроверяемыеПоля.Добавить("Менеджер");
	ПроверяемыеПоля.Добавить("Подразделение");
	ПроверяемыеПоля.Добавить("Сделка");

	РасчетСебестоимостиПрикладныеАлгоритмы.ДобавитьПредупреждениеОбОсобенностяхФормированияОтчета(
	ДокументРезультат,
	КомпоновщикНастроек,
	ПроверяемыеПоля,
	Ложь,  // Актуализировать партии
	"СтруктураПредприятия.Организация");

	РасчетСебестоимостиПрикладныеАлгоритмы.АктуализироватьПартииДляОтчетов(
	ДокументРезультат,
	КомпоновщикНастроек,
	"СтруктураПредприятия.Организация");

	ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	КомпоновкаДанныхСервер.ОформитьДиаграммыОтчета(КомпоновщикНастроек, ДокументРезультат);

	ВспомогательныеПараметры = Новый Массив;
	КомпоновкаДанныхСервер.ДобавитьВспомогательныеПараметрыОтчетаПоФункциональнымОпциям(ВспомогательныеПараметры);
	КомпоновкаДанныхСервер.СкрытьВспомогательныеПараметрыОтчета(
	СхемаКомпоновкиДанных, КомпоновщикНастроек, ДокументРезультат, ВспомогательныеПараметры);
	КомпоновкаДанныхСервер.СкрытьВспомогательныеПараметрыОтчета(
	СхемаКомпоновкиДанных, КомпоновщикНастроек, ДокументРезультат, ВспомогательныеПараметрыОтчета());

	// Сообщим форме отчета, что настройки модифицированы
	Если ПользовательскиеНастройкиМодифицированы Тогда
		КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПользовательскиеНастройкиМодифицированы", Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

//++ #1882 смарт: Шляпников 16.01.2025 / Отчет Себестоимость товаров. Добавить вывод розничных цен
Процедура СкорректироватьЗапрос(ТекстЗапроса)
	
	ИсходныйТекстРесурсов =
	"	ВЫБОР 
	|		КОГДА &ДанныеОтчета = 1 ИЛИ &ДанныеОтчета = 2 ИЛИ &ДанныеОтчета = 3
	|			ТОГДА 0
	|		КОГДА &ДанныеОтчета = 4 
	|			ТОГДА СебестоимостьТоваровОстатки.ВременнаяРазницаКонечныйОстаток
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ	КАК ВременнаяРазницаКонечныйОстаток";
	
	ТекстРесурсов = ИсходныйТекстРесурсов + ", " + "
	|	ЕСТЬNULL(ЦеныНоменклатурыДоллар.Цена, 0) КАК ЦенаДоллар,
	|	ЕСТЬNULL(ЦеныНоменклатурыЕвро.Цена, 0) КАК ЦенаЕвро,
	|	ЕСТЬNULL(ЦеныНоменклатурыРубли.Цена, 0) КАК ЦенаРубли,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(ЦеныНоменклатурыЕвро.Цена, 0) = 0 И НЕ ЕСТЬNULL(ЦеныНоменклатурыЕвро.Цена, 0) = 1000000
	|			ТОГДА ЦеныНоменклатурыЕвро.Цена
	|		КОГДА НЕ ЕСТЬNULL(ЦеныНоменклатурыДоллар.Цена, 0) = 0
	|			ТОГДА ЦеныНоменклатурыДоллар.Цена * ЕСТЬNULL(КурсДоллар.Курс, 0) * ЕСТЬNULL(КурсЕвро.Кратность, 0) / (ЕСТЬNULL(КурсДоллар.Кратность, 1) * ЕСТЬNULL(КурсЕвро.Курс, 1))
	|		КОГДА НЕ ЦеныНоменклатурыРубли.Цена ЕСТЬ NULL
	|			ТОГДА ЦеныНоменклатурыРубли.Цена * ЕСТЬNULL(КурсЕвро.Кратность, 0) / ЕСТЬNULL(КурсЕвро.Курс, 1)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЦенаРасчетнаяЕвро,
	|	КурсДоллар.Курс КАК КурсДоллар,
	|	КурсЕвро.Курс КАК КурсЕвро
	|";
	
	ИсходныйТекстСоединения =
	"	{ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПартий КАК АналитикаПартий
	|		ПО АналитикаПартий.Ссылка = СебестоимостьТоваровОстатки.АналитикаУчетаПартий
	|	}";
	
	ТекстСоединения = ИсходныйТекстСоединения + "
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних({(&КонецПериода)}, ВидЦены = &ВидЦеныДоллар) КАК ЦеныНоменклатурыДоллар
	|	ПО СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура = ЦеныНоменклатурыДоллар.Номенклатура
	|		И СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Характеристика = ЦеныНоменклатурыДоллар.Характеристика
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних({(&КонецПериода)}, ВидЦены = &ВидЦеныЕвро) КАК ЦеныНоменклатурыЕвро
	|	ПО СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура = ЦеныНоменклатурыЕвро.Номенклатура
	|		И СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Характеристика = ЦеныНоменклатурыЕвро.Характеристика
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних({(&КонецПериода)}, ВидЦены = &ВидЦеныРубли) КАК ЦеныНоменклатурыРубли
	|	ПО СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура = ЦеныНоменклатурыРубли.Номенклатура
	|		И СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Характеристика = ЦеныНоменклатурыРубли.Характеристика
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних({(&КонецПериода)}, Валюта = &ВалютаДоллар) КАК КурсДоллар
	|	ПО (ИСТИНА)
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних({(&КонецПериода)}, Валюта = &ВалютаЕвро) КАК КурсЕвро
	|	ПО (ИСТИНА)
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ИсходныйТекстРесурсов, ТекстРесурсов);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ИсходныйТекстСоединения, ТекстСоединения);
	
КонецПроцедуры

#КонецОбласти
